# Pandas

In [2]:
import pandas as pd

In [2]:
print(pd.__version__)

1.3.5

# Series

In [3]:
A = pd.Series([2,3,4,5], index=['a','b','c','d'])
A

a    2
b    3
c    4
d    5
dtype: int64

In [5]:
A[0]

2

In [6]:
type(A)

pandas.core.series.Series

In [6]:
grads_dict = {'A':4.0, 'B': 3.6, 'C': 2.8}
grads = pd.Series(grads_dict)

grads

A    4.0
B    3.6
C    2.8
dtype: float64

In [7]:
marks_dict = {'A':90, 'B': 80, 'C': 70}
marks = pd.Series(marks_dict)
marks

A    90
B    80
C    70
dtype: int64

In [8]:
import pandas as pd

res = pd.DataFrame({
    'grades': grads,
    'marks': marks
})

res

   grades  marks
A     4.0     90
B     3.6     80
C     2.8     70

In [15]:
# adding another column in above data frame

res['ScaledMarks'] = 100*(res['marks']/90)

In [16]:
res

   grades  marks  ScaledMarks
A     4.0     90   100.000000
B     3.6     80    88.888889
C     2.8     70    77.777778

In [17]:
#deleting column
del res['ScaledMarks']

In [18]:
res

   grades  marks
A     4.0     90
B     3.6     80
C     2.8     70

In [19]:
#missing value NaN

x = pd.DataFrame([
    {
      'a': 1, 
      'b':2
    },
    {
      'b':-3,
      'c':-10  
    }
])

In [20]:
x

     a  b     c
0  1.0  2   NaN
1  NaN -3 -10.0

In [21]:
x.fillna(0)

     a  b     c
0  1.0  2   0.0
1  0.0 -3 -10.0

In [23]:
res

   grades  marks
A     4.0     90
B     3.6     80
C     2.8     70

In [24]:
res.iloc[1]

grades     3.6
marks     80.0
Name: B, dtype: float64